Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: The project requires %@. This environment supports npm / pnpm; make an explicit choice. The original project lock file is retained.
zh_hans: 项目要求 %@。本环境支持 npm / pnpm，请明确选择；原项目锁文件会保留。

source: The project's packageManager conflicts with its lock file. Fix the project, or explicitly choose npm / pnpm for this environment; installation does not rewrite the project lock file.
zh_hans: 项目的 packageManager 与锁文件冲突。请整理项目，或明确选择本环境使用的 npm / pnpm；环境安装不会改写项目锁文件。

# execution.vision_tools.cannot_decode
source: (cannot decode)
zh_hans: (无法解码)

# execution.vision_tools.no_barcode_qr_code_recognized
source: No barcode/QR code recognized
zh_hans: 未识别到条码/二维码

# execution.vision_tools.no_text_recognized
source: No text recognized
zh_hans: 未识别到文字

# execution.vision_tools.ocr_failed
source: OCR failed: %@
zh_hans: OCR 失败：%@

# execution.vision_tools.recognized_barcodes_qr_codes
source: Recognized %@ barcodes/QR codes:
zh_hans: 识别到 %@ 个条码/二维码：

# execution.vision_tools.recognized_lines_of_text
source: Recognized %@ lines of text:
zh_hans: 识别到 %@ 行文字：

# feedback.entry.footer
source: Describe the problem and upload a redacted diagnostic log, or export it for manual sharing.
zh_hans: 描述问题并上传脱敏诊断日志，也可以导出后手动分享。

# feedback.error.empty
source: Please describe the problem before submitting.
zh_hans: 提交前请先描述你遇到的问题。

# feedback.error.image_too_large
source: The selected images are too large to upload.
zh_hans: 所选图片过大，无法上传。

# feedback.error.invalid_image
source: One of the selected files is not a supported image.
zh_hans: 所选文件中包含不支持的图片。

# feedback.error.invalid_response
source: The feedback service returned an invalid response.
zh_hans: 反馈服务返回了无效响应。

# feedback.error.rejected
source: The feedback service rejected the report (HTTP %d).
zh_hans: 反馈服务拒绝了报告（HTTP %d）。

# feedback.error.too_many_images
source: Attach no more than three images.
zh_hans: 最多只能附加三张图片。

# feedback.images.add
source: Add Screenshots
zh_hans: 添加截图

# feedback.images.footer
source: Up to three images. Floe resizes them and removes location and camera metadata before upload.
zh_hans: 最多三张。上传前会缩放图片并移除位置、相机等元数据。

# feedback.images.processing
source: Preparing images…
zh_hans: 正在处理图片…

# feedback.images.remove
source: Remove image
zh_hans: 移除图片

# feedback.images.title
source: Screenshots
zh_hans: 问题截图

# feedback.logs.footer
source: Logs contain app version, capability states and recent lifecycle events. API keys, credentials and token-shaped values are removed before upload.
zh_hans: 日志包含版本、能力状态与近期生命周期事件；API Key、凭据和令牌形态内容会在上传前移除。

# feedback.logs.include
source: Attach diagnostic log
zh_hans: 附加诊断日志

# feedback.logs.redacted
source: Secrets are redacted before upload
zh_hans: 上传前会自动脱敏

# feedback.logs.title
source: Diagnostics
zh_hans: 诊断信息

# feedback.open
source: Report a Problem
zh_hans: 反馈问题并上传日志

# feedback.problem.footer
source: Include what you were doing, what happened, and whether it happens every time.
zh_hans: 请写明当时在做什么、发生了什么，以及是否每次都能复现。

# feedback.problem.placeholder
source: For example: I tapped the microphone, granted access, and the app closed immediately…
zh_hans: 例如：点击麦克风并授权后，App 立即退出……

# feedback.problem.title
source: What happened?
zh_hans: 你遇到了什么问题？

# feedback.submit
source: Submit
zh_hans: 提交

# feedback.success.message
source: Reference: %@. Thank you for helping improve Floe Agent.
zh_hans: 参考编号：%@。感谢你帮助改进 Floe Agent。

# feedback.success.title
source: Feedback Sent
zh_hans: 反馈已发送

# feedback.title
source: Problem Report
zh_hans: 问题反馈

# file.preview.more
source: More
zh_hans: 更多

# file.preview.share
source: Share
zh_hans: 分享

# files.compress.action
source: Compress
zh_hans: 压缩

# files.compress.cancel
source: Cancel Compression
zh_hans: 取消压缩

# files.compress.confirm
source: Compress
zh_hans: 压缩

# files.compress.conflict_note
source: A file with that name exists; using %@
zh_hans: 同名文件已存在，将使用 %@

# files.compress.done
source: Created archive %@
zh_hans: 已创建压缩包 %@

# files.compress.format
source: Format
zh_hans: 格式

# files.compress.format.tbz2_note
source: TAR.BZ2 can be created on this device but cannot be extracted in the app; open it in a Linux environment.
zh_hans: TAR.BZ2 可在设备上创建，但应用内暂不能解压；可在 Linux 环境中打开。

# files.compress.name
source: File Name
zh_hans: 文件名

# files.compress.name.placeholder
source: Archive name
zh_hans: 压缩包名称

# files.compress.phase.reading
source: Reading
zh_hans: 正在读取

# files.compress.phase.scanning
source: Scanning
zh_hans: 正在扫描

# files.compress.phase.writing
source: Writing
zh_hans: 正在写入

# files.compress.preparing
source: Preparing…
zh_hans: 正在准备…

# files.compress.title
source: Compress Selected Items
zh_hans: 压缩所选项目

# files.conflict.title
source: Save conflict
zh_hans: 保存冲突

# files.edit_image
source: Edit Image
zh_hans: 编辑图片

# files.export
source: Export
zh_hans: 导出

# files.files_view.generate_image
source: Generate image
zh_hans: 生成图片

# files.image_editor_view.ai_edit
source: AI edit
zh_hans: AI 编辑

# files.image_editor_view.describe_how_you_want_the_image
source: Describe how you want the image changed
zh_hans: 描述希望如何修改图片

# files.open
source: Open File
zh_hans: 打开文件

# files.preview
source: Preview
zh_hans: 预览

# files.remote_image_creation_view.count
source: Count: %@
zh_hans: 数量：%@

# files.remote_image_creation_view.generating
source: Generating…
zh_hans: 正在生成…

# files.remote_image_creation_view.image_description
source: Image description
zh_hans: 图片描述

# files.unavailable
source: File unavailable
zh_hans: 文件不可用

# files.unavailable.hint
source: The file could not be opened.
zh_hans: 无法打开该文件。

# fonts.device_font_store.font_download_failed_http
source: Font download failed (HTTP %@).
zh_hans: 字体下载失败（HTTP %@）。

# fonts.device_font_store.only_ttf_otf_ttc_and_otc
source: Only TTF, OTF, TTC and OTC fonts are supported.
zh_hans: 仅支持 TTF、OTF、TTC 和 OTC 字体。

# fonts.device_font_store.the_file_is_not_a_coretext
source: The file is not a CoreText-recognizable font.
zh_hans: 文件不是 CoreText 可识别的字体。

# fonts.device_font_store.the_font_file_exceeds_the_32
source: The font file exceeds the 32 MB limit.
zh_hans: 字体文件超过 32 MB 限制。

# fonts.device_font_store.this_floe_global_font_cannot_be
source: This Floe global font cannot be found.
zh_hans: 找不到这个 Floe 全局字体。

# git.git_hub_service.github_sign_in_has_no_oauth
source: GitHub sign-in has no OAuth Client ID configured
zh_hans: GitHub 登录尚未配置 OAuth Client ID

# git.git_hub_service.the_github_app_has_not_enabled
source: The GitHub app has not enabled Device Flow yet
zh_hans: GitHub 应用尚未启用 Device Flow

# git.git_hub_service.the_github_sign_in_code_has
source: The GitHub sign-in code has expired; please sign in again
zh_hans: GitHub 登录验证码已过期，请重新登录

# git.local_git_service.already_up_to_date
source: Already up to date
zh_hans: 已经是最新

# git.local_git_service.conflicts_resolved_merge_complete
source: Conflicts resolved, merge complete
zh_hans: 冲突已解决，合并完成

# git.local_git_service.currently_only_https_connections_to_github
source: Currently only HTTPS connections to GitHub repositories are supported
zh_hans: 目前仅支持通过 HTTPS 连接 GitHub 仓库

# git.local_git_service.fast_forward_merged
source: Fast-forward merged
zh_hans: 已快进合并

# git.local_git_service.merge_complete
source: Merge complete
zh_hans: 合并完成

# git.local_git_service.the_merge_has_conflicts_resolve_each
source: The merge has conflicts; resolve each one before submitting
zh_hans: 合并存在冲突，请逐个解决后提交

# git.local_git_service.the_repository_url_cannot_contain_an
source: The repository URL cannot contain an account or credentials; save them separately in the GitHub connection
zh_hans: 仓库地址不能包含账号或凭据，请在 GitHub 连接中单独保存

# git.local_git_service.unresolved_conflicts_remain
source: Unresolved conflicts remain
zh_hans: 仍有未解决的冲突

# github.auth.workflows
source: Allow GitHub Actions workflow setup
zh_hans: 允许配置 GitHub Actions 工作流

# github.auth.workflows.detail
source: Enable this when installing build templates. Existing credentials are unchanged until you sign in again.
zh_hans: 安装构建模板时开启。已有凭据只会在重新登录并授权后更新。

# goal.confirm_complete
source: Confirm completion
zh_hans: 确认完成

# goal.title
source: Goal
zh_hans: 目标

# home.active_tasks
source: Active Tasks
zh_hans: 进行中的任务

# home.capability.approvals
source: Scoped approvals
zh_hans: 范围化授权

# home.capability.remote
source: Remote sessions
zh_hans: 远程会话

# home.capability.threads
source: Durable threads
zh_hans: 持久任务线程

# home.capability.workspace
source: Workspaces
zh_hans: 工作区

# home.composer.ready
source: Ready
zh_hans: 已就绪

# home.composer.title
source: Start a task
zh_hans: 开始一个任务

# home.connection
source: Connection
zh_hans: 连接

# home.detail.subtitle
source: Start in the workbench, then inspect every decision and result in its thread.
zh_hans: 从左侧工作台开始，再到任务线程中查看每个决定和结果。

# home.detail.title
source: Your agent workspace
zh_hans: 你的智能体工作空间

# home.draft_task_permissions_sheet.approval_mode
source: Approval Mode
zh_hans: 审批模式

# home.draft_task_permissions_sheet.confirm_enabling_full_access_for_the
source: Confirm enabling Full Access for the new task
zh_hans: 确认新任务启用完全访问权限

source: Deletion, payments, credentials, uploads and catastrophic commands remain under mandatory protection.
zh_hans: 删除、付款、凭据、上传和灾难性命令仍受强制保护。

# home.draft_task_permissions_sheet.low_risk_actions_are_approved_automatically
source: Low-risk actions are approved automatically; sensitive actions still ask.
zh_hans: 低风险自动批准，敏感操作仍会询问。

# home.draft_task_permissions_sheet.new_task
source: New task
zh_hans: 新任务

source: Ordinary actions run automatically; mandatory protections remain in effect.
zh_hans: 普通操作自动执行，强制保护仍然有效。

# home.draft_task_permissions_sheet.reads_run_automatically_side_effecting_actions
source: Reads run automatically; side-effecting actions ask first.
zh_hans: 读取自动运行，副作用操作会先询问。

# home.draft_task_permissions_sheet.task_permissions
source: Task Permissions
zh_hans: 任务权限

# home.empty.subtitle
source: Describe a task below and Floe gets to work.
zh_hans: 在下方描述任务，Floe 即刻开始。

# home.empty.title
source: What should Floe do?
zh_hans: 让 Floe 做点什么？

# home.entry.available.hint
source: Opens the related feature.
zh_hans: 打开对应功能。

# home.entry.hosts
source: Remote hosts
zh_hans: 远程主机

# home.entry.images
source: Image tools
zh_hans: 图片处理

# home.entry.providers
source: Model providers
zh_hans: 模型提供商

# home.entry.unavailable.hint
source: Not available yet.
zh_hans: 该功能尚未提供。

# home.entry.workspace
source: Workspace files
zh_hans: 工作区文件

# home.home_overview_view.completed
source: Completed
zh_hans: 已完成

# home.home_overview_view.delete_schedule
source: Delete schedule
zh_hans: 删除安排

# home.home_overview_view.delete_selection
source: Delete selection
zh_hans: 删除所选

# home.home_overview_view.estimated
source: Estimated %@
zh_hans: 预计 %@

# home.home_overview_view.failed_or_interrupted
source: Failed or interrupted
zh_hans: 失败或中断

# home.home_overview_view.last_actual
source: Last actual %@
zh_hans: 最近实际 %@

# home.home_overview_view.permanently_delete_archived_tasks
source: Permanently delete archived tasks?
zh_hans: 永久删除归档任务？

# home.home_overview_view.restore_selection
source: Restore selection
zh_hans: 恢复所选

# home.home_overview_view.running
source: Running
zh_hans: 运行中

# home.home_overview_view.schedule_task
source: Schedule task
zh_hans: 安排任务

# home.home_overview_view.scheduled
source: Scheduled
zh_hans: 已安排

# home.home_overview_view.search_tasks
source: Search tasks
zh_hans: 搜索任务

# home.home_overview_view.select_multiple
source: Select multiple
zh_hans: 选择多个

# home.home_overview_view.the_selected_tasks_and_their_private
source: The selected tasks and their private data will be permanently deleted.
zh_hans: 所选任务及其私有数据将被永久删除。

# home.new_task.placeholder
source: What should Floe do?
zh_hans: 想让 Floe 做什么？

# home.no_active
source: No active tasks
zh_hans: 暂无进行中的任务

# home.no_active.detail
source: New work will appear here while it is running.
zh_hans: 新任务运行时会显示在这里。

# home.no_pending
source: No pending approvals
zh_hans: 暂无待批准事项

# home.no_pending.detail
source: Actions that need your decision will wait here.
zh_hans: 需要你决定的操作会在这里等待。

# home.no_sessions
source: No recent sessions
zh_hans: 暂无最近会话

# home.no_sessions.detail
source: SSH and VNC connections will show their real state here.
zh_hans: SSH 与 VNC 连接会在这里显示真实状态。

# home.overview.empty
source: Start a task from the Home screen and it will appear here.
zh_hans: 从首页开始一个任务后，它会显示在这里。

# home.pending_approvals
source: Pending Approvals
zh_hans: 待批准

# home.quick_entries
source: Quick actions
zh_hans: 快捷入口

# home.recent
source: Recent
zh_hans: 最近

# home.task_schedule_sheet.chat_private_workspace
source: Chat (private workspace)
zh_hans: 聊天（私有工作区）

# home.task_schedule_sheet.daily
source: Daily
zh_hans: 每天

# home.task_schedule_sheet.estimated_execution
source: Estimated execution
zh_hans: 预计执行

# home.task_schedule_sheet.ios_wakes_the_app_based_on
source: iOS wakes the app based on available system resources; the estimated time is not a minute-level guarantee, and Task Center always shows the most recent actual run time.
zh_hans: iOS 会按系统资源尽力唤醒；预计时间不是分钟级保证，任务中心会同时显示最近实际执行时间。

# home.task_schedule_sheet.once
source: Once
zh_hans: 一次

# home.task_schedule_sheet.project_and_time
source: Project and time
zh_hans: 项目与时间

# home.task_schedule_sheet.weekly
source: Weekly
zh_hans: 每周

# home.welcome
source: What should Floe get done today?
zh_hans: 今天想让 Floe 完成什么？

# home.workspace.subtitle
source: Create a task, review approvals, and return to live sessions.
zh_hans: 创建任务、审核授权，并随时返回活动会话。

# home.workspace.title
source: Operations desk
zh_hans: 任务工作台

# hosts.add
source: Add Host
zh_hans: 添加主机

# hosts.address
source: Address
zh_hans: 地址

# hosts.auth
source: Method
zh_hans: 方式

# hosts.auth.device_key
source: Device Key
zh_hans: 设备密钥

# hosts.auth.imported_key
source: Imported Key
zh_hans: 导入密钥

# hosts.auth.password
source: Password
zh_hans: 密码

# hosts.authentication
source: Authentication
zh_hans: 身份验证

# hosts.connection
source: Connection
zh_hans: 连接

# hosts.display_name
source: Display name
zh_hans: 显示名称

# hosts.edit
source: Edit Host
zh_hans: 编辑主机

# hosts.enable_vnc
source: Add VNC connection
zh_hans: 添加 VNC 连接

# hosts.fingerprint
source: SHA256 fingerprint
zh_hans: SHA256 指纹

# hosts.host_editor_view.add_another_connection
source: Add another connection
zh_hans: 添加其他连接

# hosts.host_editor_view.as_a_remote_execution_environment
source: As a remote execution environment
zh_hans: 作为远端执行环境

# hosts.host_editor_view.ble_peripheral_uuid
source: BLE peripheral UUID
zh_hans: BLE 外设 UUID

# hosts.host_editor_view.ble_serial
source: BLE serial
zh_hans: BLE 串口

# hosts.host_editor_view.ble_serial_uses_the_device_s
source: BLE serial uses the device's public GATT services; classic Bluetooth SPP only works with vendor-enabled MFi accessories.
zh_hans: BLE 串口使用设备公开的 GATT 服务；传统蓝牙 SPP 仅适用于厂商开放的 MFi 配件。

# hosts.host_editor_view.connection_method
source: Connection method
zh_hans: 连接方式

# hosts.host_editor_view.connection_name
source: Connection name
zh_hans: 连接名称

# hosts.host_editor_view.device_name
source: Device name
zh_hans: 设备名称

# hosts.host_editor_view.device_type
source: Device type
zh_hans: 设备类型

# hosts.host_editor_view.device_type_is_informational_only_the
source: Device type is informational only; the protocol configuration determines available capabilities. The Floe daemon is not installed unless remote execution is enabled.
zh_hans: 设备类型仅供参考；协议配置决定可用能力。未启用远端执行时不会安装 Floe 守护程序。

# hosts.host_editor_view.direct_vnc
source: Direct VNC
zh_hans: 直接 VNC

# hosts.host_editor_view.enter_a_new_password_to_replace
source: Enter a new password to replace the saved one
zh_hans: 输入新密码以替换已保存密码

# hosts.host_editor_view.hide_host_credentials
source: Hide host credentials
zh_hans: 隐藏主机凭据

# hosts.host_editor_view.linux_host
source: Linux host
zh_hans: Linux 主机

# hosts.host_editor_view.network_device
source: Network device
zh_hans: 网络设备

# hosts.host_editor_view.notify_characteristic_uuid_optional
source: Notify characteristic UUID (optional)
zh_hans: 通知特征 UUID（可选）

# hosts.host_editor_view.one_device_can_store_both_plain
source: One device can store both plain VNC and SSH-tunnel VNC; credentials are kept only in Keychain.
zh_hans: 同一设备可同时保存普通 VNC 和 SSH 隧道 VNC；凭据只保存在钥匙串。

# hosts.host_editor_view.other_connections
source: Other connections
zh_hans: 其他连接

# hosts.host_editor_view.other_devices
source: Other devices
zh_hans: 其他设备

# hosts.host_editor_view.password_not_configured
source: Password not configured
zh_hans: 未配置密码

# hosts.host_editor_view.password_saved_securely
source: Password saved securely
zh_hans: 密码已安全保存

# hosts.host_editor_view.plain_tcp
source: Plain TCP
zh_hans: 普通 TCP

# hosts.host_editor_view.port
source: Port
zh_hans: 端口

# hosts.host_editor_view.router
source: Router
zh_hans: 路由器

# hosts.host_editor_view.service_uuid
source: Service UUID
zh_hans: 服务 UUID

# hosts.host_editor_view.set_vnc_password
source: Set VNC password
zh_hans: 设置 VNC 密码

# hosts.host_editor_view.ssh_connection
source: SSH connection
zh_hans: SSH 连接

# hosts.host_editor_view.ssh_is_an_optional_connection_method
source: SSH is an optional connection method for the device; only VNC, Telnet, TCP or BLE serial devices do not need it.
zh_hans: SSH 是设备可选的连接方式；仅 VNC、Telnet、TCP 或 BLE 串口设备无需启用。

# hosts.host_editor_view.ssh_target_side_address
source: SSH target-side address
zh_hans: SSH 目标侧地址

# hosts.host_editor_view.switch
source: Switch
zh_hans: 交换机

# hosts.host_editor_view.the_floe_daemon_is_automatically_checked
source: The Floe daemon is automatically checked and maintained before running a remote task.
zh_hans: 运行远端任务前会自动检查并维护 Floe 守护程序。

# hosts.host_editor_view.unspecified
source: Unspecified
zh_hans: 未指定

# hosts.host_editor_view.verify_identity_to_view_host_credentials
source: Verify identity to view host credentials
zh_hans: 验证身份并查看主机凭据

# hosts.host_editor_view.vnc_address
source: VNC address
zh_hans: VNC 地址

# hosts.host_editor_view.vnc_connection
source: VNC connection
zh_hans: VNC 连接

# hosts.host_editor_view.vnc_over_ssh_tunnel
source: VNC over SSH tunnel
zh_hans: VNC 经 SSH 隧道

# hosts.host_editor_view.windows_host
source: Windows host
zh_hans: Windows 主机

# hosts.host_editor_view.write_characteristic_uuid
source: Write characteristic UUID
zh_hans: 写入特征 UUID

# hosts.host_editor_view_model.the_saved_host_credentials_are_not
source: The saved host credentials are not displayable text
zh_hans: 保存的主机凭据不是可显示的文本

# hosts.host_editor_view_model.view_saved_host_credentials
source: View saved host credentials
zh_hans: 查看已保存的主机凭据

# hosts.host_key
source: Host Key
zh_hans: 主机密钥

# hosts.host_list_view.creates_a_device_specific_certificate_over
source: Creates a device-specific certificate over verified SSH; the private key is kept only on this device. Daily tasks then use mTLS and SSH is for recovery only.
zh_hans: 通过已验证 SSH 创建本设备专属证书；私钥只保存在本设备。之后日常任务走 mTLS，SSH 仅用于救援。

# hosts.host_list_view.debug_target
source: Debug target
zh_hans: 调试目标

# hosts.host_list_view.host_actions
source: Host actions
zh_hans: 主机操作

# hosts.host_list_view.installs_the_daemon_matching_the_current
source: Installs the daemon matching the current Floe version over verified SSH; a failed update rolls back automatically.
zh_hans: 将通过已验证的 SSH 安装与当前 Floe 版本配套的守护程序；更新失败会自动回滚。

# hosts.host_list_view.more_host_actions
source: More host actions
zh_hans: 更多主机操作

# hosts.host_list_view.pair
source: Pair %@
zh_hans: 配对 %@

# hosts.host_list_view.pair_advanced_link
source: Pair advanced link
zh_hans: 配对高级链路

# hosts.host_list_view.remote_execution_environment
source: Remote execution environment
zh_hans: 远端执行环境

# hosts.host_list_view.set_up_an_advanced_link_for
source: Set up an advanced link for this device?
zh_hans: 为本设备建立高级链路？

# hosts.host_list_view.ssh_not_configured
source: SSH not configured
zh_hans: 未配置 SSH

# hosts.host_list_view.update
source: Update %@
zh_hans: 更新 %@

# hosts.host_list_view.update_floe_daemon
source: Update Floe daemon
zh_hans: 更新 Floe 守护程序

# hosts.host_list_view.update_the_floe_daemon
source: Update the Floe daemon?
zh_hans: 更新 Floe 守护程序？

# hosts.host_list_view_model.a_dedicated_mtls_advanced_link_was
source: A dedicated mTLS advanced link was established for this device.
zh_hans: 已为本设备建立独立 mTLS 高级链路。

# hosts.host_list_view_model.the_floe_daemon_has_been_updated
source: The Floe daemon has been updated to %@.
zh_hans: Floe 守护程序已更新到 %@。

# hosts.pin_fingerprint
source: Pin fingerprint (strict)
zh_hans: 固定指纹（严格）

# hosts.port
source: Port
zh_hans: 端口

# hosts.private_key
source: Private key
zh_hans: 私钥

# hosts.secret.hint
source: Stored only in Keychain, never in the database.
zh_hans: 仅存储于钥匙串，绝不写入数据库。

# hosts.terminal
source: Terminal
zh_hans: 终端

# hosts.tofu.hint
source: By default the host key is trusted on first use and pinned thereafter.
zh_hans: 默认首次使用时信任主机密钥，此后固定。

# hosts.user
source: User
zh_hans: 用户

# hosts.vnc.hint
source: Use a direct VNC connection or protect it with a verified SSH tunnel.
zh_hans: 可直接连接 VNC，也可通过已验证的 SSH 隧道保护连接。

# hosts.vnc_password
source: VNC password
zh_hans: VNC 密码

# hosts.vnc_port
source: VNC port
zh_hans: VNC 端口

# ide.back
source: Back to IDE
zh_hans: 返回 IDE

# ide.close
source: Close IDE
zh_hans: 关闭 IDE

# ide.continue
source: Keep Editing
zh_hans: 继续编辑

# ide.discard.close
source: Discard and Close
zh_hans: 放弃更改并关闭

# ide.open
source: Open in IDE
zh_hans: 在 IDE 中打开

# ide.open.editor
source: Open in Editor
zh_hans: 用专用编辑器打开

# ide.process.stopped
source: The editor stopped unexpectedly. Unsaved changes may not have reached disk.
zh_hans: 编辑器意外停止，未保存的更改可能尚未写入文件。

# ide.resources.missing
source: IDE resources are missing.
zh_hans: IDE 资源缺失。

# ide.save.all
source: Save All
zh_hans: 全部保存

# ide.save.close
source: Save and Close
zh_hans: 保存并关闭

# ide.save.failed
source: Some files could not be saved. Your changes remain open.
zh_hans: 部分文件保存失败，编辑内容已保留。

# ide.terminal
source: Terminal
zh_hans: 终端

# ide.unsaved
source: Keep your unsaved changes?
zh_hans: 存在未保存的更改

# ide.workspace
source: Workspace
zh_hans: 工作区

# ide.workspace.unavailable
source: Workspace unavailable
zh_hans: 工作区不可用

# image.unsupported
source: Not supported by this provider
zh_hans: 此提供商不支持

# image.unsupported.hint
source: This image operation isn't supported by the selected provider.
zh_hans: 所选提供商不支持此图片操作。

# inspector.back
source: Back
zh_hans: 返回

# inspector.close
source: Close inspector
zh_hans: 关闭检查器

# inspector.conflict.title
source: File changed on disk
zh_hans: 文件已在磁盘上被修改

# inspector.context.add
source: Add to conversation
zh_hans: 加入对话上下文

# inspector.context.added_format
source: Added workspace file to context: %@
zh_hans: 已将工作区文件加入上下文：%@

# inspector.context.no_conversation
source: Open a conversation first to add context
zh_hans: 请先打开一个对话再加入上下文

# inspector.diff.added
source: Added:
zh_hans: 新增：

# inspector.diff.removed
source: Removed:
zh_hans: 删除：

# inspector.editor.cancel
source: Cancel
zh_hans: 取消

# inspector.editor.edit
source: Edit
zh_hans: 编辑

# inspector.editor.error
source: Cannot open file
zh_hans: 无法打开文件

# inspector.editor.preview
source: Preview
zh_hans: 预览

# inspector.editor.save
source: Save
zh_hans: 保存

# inspector.editor.save_failed
source: Save failed
zh_hans: 保存失败

# inspector.empty
source: No workspace is open yet. Open a project from the composer to inspect its files here.
zh_hans: 尚未打开工作区。从输入框选择项目后，即可在这里检查文件。

# inspector.files
source: File inspector
zh_hans: 文件检查器

# inspector.no_workspace
source: No workspace is open
zh_hans: 尚未打开工作区

# inspector.preview.binary
source: This document is previewed with Quick Look
zh_hans: 此文档通过快速查看预览

# inspector.preview.edit
source: Edit
zh_hans: 编辑

# inspector.preview.error
source: Cannot preview file
zh_hans: 无法预览文件

# inspector.preview.loading
source: Loading…
zh_hans: 加载中…

# inspector.preview.quicklook
source: Quick Look
zh_hans: 快速查看

# inspector.preview.truncated
source: File truncated — first 64 KB shown
zh_hans: 文件已截断 — 仅显示前 64 KB
